calendar/app/controllers/events_controller.rb

  def edit
    @user_event = current_user.events.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]