calendar/app/controllers/events_controller.rb

SELECT "events".* FROM "events" ORDER BY "events"."start_time" DESC
---
  def index
    @events = Event.all.order(start_time: :desc)

SELECT  "events".* FROM "events" WHERE "events"."user_id" = $1 AND "events"."id" = $2 LIMIT $3  [["user_id", 10], ["id", 16], ["LIMIT", 1]]
---
  def edit
    @user_event = current_user.events.find(params[:id])

INSERT INTO "events" ("title", "body", "start_time", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "фы"], ["body", "фыва"], ["start_time", "2018-06-03"], ["user_id", 10], ["created_at", "2018-06-02 21:02:41.969557"], ["updated_at", "2018-06-02 21:02:41.969557"]]
---
  def create
    @event = current_user.events.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["title", "Kamil"], ["body", "Khadeev"], ["updated_at", "2018-06-08 11:54:00.798746"], ["id", 14]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = $1  [["id", 15]]
---
  def destroy
    @event.destroy

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
    def set_event
      @event = Event.find(params[:id])