calendar/app/models/user.rb

  def self.from_omniauth(access_token)
    data = access_token.info
    user = User.where(:email => data["email"]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "camelot729@gmail.com"], ["LIMIT", 1]]